window.addEventListener("load", function () {
  let news_overlay = document.querySelector(".news_overlay")
  let btn_cross = document.querySelector(".btn_cross")
  let btn_arrow = document.querySelector(".btn_arrow")
  let news_blog = document.querySelector(".news_blog")
  /* Новости */
  let new0 = document.querySelector(".new0")
  let new1 = document.querySelector(".new1")
  let new2 = document.querySelector(".new2")
  let new3 = document.querySelector(".new3")
  let new4 = document.querySelector(".new4")

  /* Управление новостями */
  btn_cross.addEventListener("click", function () {
    document.getElementsByTagName("body")[0].style.overflow = "auto"
    let news_image = document.querySelector(".news_image")
    let news_date = document.querySelector(".news_date")
    let news_text = document.querySelector(".news_text")
    let animate = news_image.animate(
      [{ transform: "translateY(0%)" }, { transform: "translateY(-30%)" }],
      { duration: 300 }
    )
    news_date.animate(
      [{ transform: "translateX(0%)" }, { transform: "translateX(-30%)" }],
      { duration: 300 }
    )
    news_text.animate(
      [{ transform: "translateX(0%)" }, { transform: "translateX(30%)" }],
      { duration: 300 }
    )
    btn_cross.animate([{ transform: "rotate(360deg)" }], { duration: 800 })
    news_overlay.classList.remove("overlay_open")
    animate.addEventListener("finish", function () {
      clearNews()
    })
  })
  btn_arrow.addEventListener("click", function () {
    news_overlay.scrollTo({ top: 0, behavior: "smooth" })
  })
  news_overlay.addEventListener("scroll", function () {
    if (news_overlay.scrollTop > 150) {
      btn_arrow.classList.add("btn_arrow-active")
    } else {
      btn_arrow.classList.remove("btn_arrow-active")
    }
  })
  function showNews() {
    let news_image = document.querySelector(".news_image")
    let news_date = document.querySelector(".news_date")
    let news_text = document.querySelector(".news_text")
    news_overlay.classList.add("overlay_open")
    news_image.animate(
      [{ transform: "translateY(-30%)" }, { transform: "translateY(0%)" }],
      { duration: 300 }
    )
    news_date.animate(
      [{ transform: "translateX(30%)" }, { transform: "translateX(0%)" }],
      { duration: 300 }
    )
    news_text.animate(
      [{ transform: "translateX(-30%)" }, { transform: "translateX(0%)" }],
      { duration: 300 }
    )
    btn_cross.animate([{ transform: "rotate(-360deg)" }], { duration: 300 })
    document.getElementsByTagName("body")[0].style.overflow = "hidden"
  }
  function clearNews() {
    news_blog.innerHTML = ""
  }
  /* Создание структуры новости */
  function create_news_image(class_name, data) {
    let news_image = document.createElement("img")
    news_image.className = class_name
    news_image.src = data
    news_blog.appendChild(news_image)
  }
  function create_news_date(class_name, data) {
    let news_date = document.createElement("div")
    news_date.className = class_name
    news_date.innerHTML = data
    news_blog.appendChild(news_date)
  }
  function create_news_text(class_name, data) {
    let news_text = document.createElement("div")
    news_text.className = class_name
    news_text.innerHTML = data
    news_blog.appendChild(news_text)
  }

  /* Новости */
  new0.addEventListener("click", function () {
    create_news_image("news_image", "img/site/1-1.jpg")
    create_news_date("news_date", "<span>27 АВГУСТА 2020 г.</span>")
    create_news_text(
      "news_text",
      '<p>Первый пост своего блога я хотел бы посвятить тому, как я всё-таки дошёл до жизни такой. Как и многих других разработчиков, меня в эту сферу затянуло неуёмное желание «пощупать» программирование и понять, что это за чувство: напишешь пару строк, а на экране забегают человечки.</p><p>В общем, это наивное стремление меня долго не отпускало и всё пришло к тому, что я таки мало-помалу начал вникать в основы программирования, так хорошо и основательно забытого со времён студенческой скамьи.</p><p>Освоив базовую вёрстку и основы функционального программирования, я принялся крепко думать, какой формат вожделённой игры мне окажется по силам. Мысленно я унёсся в далёкий 2004 г. Тогда такие игры, как Fallout, Fallout 2 и Fallout Tactics были уже пройдены по десятку раз каждая, а про Fallout 3 ходили только самые безумные слухи. И вот это был самый рассвет фанатского творчества. В ожидании новой части, изголодавшиеся фанаты играли во всё, что выходило из под клавиатуры умелых (а порой и безруких) кодеров. Среди прочих мне сразу вспоминаются такие проекты как Brave Paladin (2001) и Brave Paladin 2 (2004), Brave Ranger (1999) и Brave Ranger 2 (2001), Fallout: Bloody Revenge Demo (2002), ну и само собой одна из лучших – Fallout Quest. Не сложно догадаться, что главной для меня игрой тогда (впрочем, и сегодня тоже) был и остаётся Fallout. Как же мне захотелось вернуть в то ламповое время текстовых квестов!</p><p>23 марта 2020 г. я твёрдо решил, что это будет текстовый квест по мотивам первой части Fallout. Тему сюжета я нашёл довольно быстро. Общую концепцию сценария я уже через пару дней визуализировал на мольберте. Но написание самого сценария стало для меня сущим адом. Опыт сочинения коротких рассказов у меня уже был, пусть и небольшой, но был. А вот писать сценарий к текстовой игре мне раньше не приходилось. Чем дальше я заходил в реализации основного сценария, тем запутаннее становились ветки возможных вариантов. Сутками я сидел и барабанил по клавиатуре, пока весь мир задыхался от бушующей эпидемии COVID-19. Так прошло несколько месяцев.</p><p>Параллельно с написанием сценария я пилил движок (назовём это так!) игры. Код получился примитивный, т.к. прежде чем сесть за реализацию игры, Javascript я схватил только по верхам. Небольшой опыт вёрстки также сыграл со мной злую шутку: я допустил довольно грубую (и глупую) ошибку в позиционировании изображений. Из-за этого практически все картинки в игре были созданы мною исключительно костыльным способом. Когда я спохватился и нашёл верное решение, было уже поздно: сотни изображений уже были мною же созданы. Переделывать их заново я уже не стану, так как труда там – море бездонное. Всё же стоит отметить, что мои первые альфа-тестеры так и не заметили этой моей ошибки, так что внешне всё выглядит пристойно!</p><img class="news_image" src="img/site/1-2.jpg" alt="img1-2"/><p>На сегодня сценарий игры завершён. Интерфейс готов и основная механика работает. Я бы отметил состояние готовности около 70%. Что предстоит реализовать:</p><p>- Финальные окна</p><p>- Систему сохранения</p><p>- Разбить код на разные файлы для облегчения работы</p><p>В общем, работы ещё много. Но я добью до конца. Я упёртый.</p>'
    )
    showNews()
  })
  new1.addEventListener("click", function () {
    create_news_image("news_image", "img/site/2-1.jpg")
    create_news_date("news_date", "<span>23 СЕНТЯБРЯ 2020 г.</span>")
    create_news_text(
      "news_text",
      "<p>Ну, что же! Я, таки, добил игрушечку. Честно говоря, я даже поверить в это до конца не могу! Самое время дать ей имя. Долго думал, стоит ли примазываться к названию Fallout. В итоге решил, что стоит. В сети достаточно проектов, которые сделали это. Пусть будет ещё один. Fallout: Операция «Возмездие».</p><p>Хочу отметить: версия игры - 0.4b, а это означает, что, несмотря на то, что игра уже может быть пройдена полностью, всё же имеется ряд технических проблем, которые пока присутствуют или ещё не выявлены. Куда ж без мелких багов?</p><p>Вспоминаю, как когда-то я пытался устроиться в отдел сопровождения баз данных в своём банке. В конце собеседования мне задали вопрос: «В проекте после релиза выявлен ряд серьёзных ошибок. Чья это вина это вина: разработчика или тестировщика?». Я не буду приводить свой дословный позорный ответ. Скажу лишь, что он был не в пользу разработчика. Наверное, всё же стоит сперва хорошенько погрузиться в теорию разработки, а потом облачиться в шкуру сперва первого, а затем второго, чтобы до конца для себя понять роль каждого из них.</p><p>До версии 0.2а я сам был единственным тестировщиком собственного проекта, и теперь чётко осознаю важность этой прелестной профессии. Очень хорошо, что таковая выделена в отдельное направление! Сейчас пришла пора сделать следующий шаг и задействовать моих невидимых помощников в закрытом бета-тестировании.</p><p>У меня есть ещё несколько идей, которые хотелось бы реализовать, но я их не стану озвучивать, т.к. не уверен, что смогу уделить данному проекту столько же времени, сколько мог уделять раньше. Однако, некоторыми новостями касательно того, что сделано к сегодняшнему дню, я хотел бы поделиться.</p><p>Во-первых, выше я уже упоминал о том, что игра уже может быть пройдена до конца. Это означает, что анонсированные ранее «финальные окна» были сделаны. В них уже нет той неявной и лукавой беды с изображениями, о которой я говорил в своём первом посте. Откровенно говоря, я, наверное, зря уделяю такое внимание этой проблеме, которую пользователи совершенно не должны брать во внимание, так как при прохождении, скорое всего, никаких неудобств не ощутят. Тут дело больше в моей личной раздосадованности от совершенной ошибки. Всё! Забыли об этом.</p><p>Во-вторых, в v.0.3a была реализована система сохранения, которая задействует LocalStorage на стороне браузера пользователя. Печеньки я целенаправленно рассматривать не стал, т.к. у многих есть разные предубеждения касательно них. Ну, их к чёрту. В LocalStorage вы сами можете узреть, что сохранил ваш браузер. Однако, в случае с моей игрой, если вы простой юзер, а не разработчик, я этого делать не советую. Там особо ничего интересного нет: лишь файл с перечнем переменных. Все переменные названы логично, хоть и на английском языке. Таким образом, ознакомившись со списком переменных, вы просто угробите себе интерес к сюжету. Это как ознакомиться с оглавлением книги перед её прочтением. Иногда это бывает тем ещё спойлером.</p><p>В-третьих, я сделал монитор статуса сохранения. Работает это следующим образом: в тех местах, где сохраниться нельзя, монитор будет отображать сообщение о невозможности сохранения, в прочих местах будет отображаться сообщение об успешном сохранении. Хотелось бы ещё порассуждать на тему сохранений. На этот раз не о техничной составляющей этого процесса, а о его философской стороне. Я ярый противник всяческих сохранений в играх. Возможно, древнее пристрастие к NES-играм конца 80х во мне всё ещё барахтается, а может быть это стремление к некоторому подобию реализма в играх, но мне не нравится идея сохранений именно в том, что краткосрочная и среднесрочная перспективы ветвления сюжета начисто лишены смысла, так как будут убиты бесконечными перезагрузками. Для меня роскошными вариантами в данном случае являются такие игры как Operation Flashpoint (где есть возможность сохраняться 1 раз) и Dying Light (где возможности сохраняться в любой момент времени прохождения сюжета у пользователя нет). Хотя такое сравнение не совсем корректно, т.к. и класс, и характер этих игр отличаются от жанра текстового квеста. У собратьев по жанру я удачных решений не нашёл. Вначале была мысль сделать автоматическое сохранение в одном месте, однако, один из тестеров отсоветовал мне это делать. В конце концов, я решил дать пользователю возможность ломать себе интерес на своё усмотрение. Оставлю лишь один маленький спойлер: в игре схема сюжета реализована таким образом, что регулярное сохранение может привести к тому, что придётся всё заново начинать, т.к. это будет своего рода шах и мат, в котором очередное сохранение будет сделано после шаха. Так что лучший вариант: сохраняйтесь в «спокойных» местах!</p><p>В скором времени я переведу проект в закрытый репозиторий GitHub, для того, чтобы мой самый доверенный товарищ смог уличить меня в безграмотности и незнании основ родного языка. Как говорят разведчики, в тексте довольно много погрешностей и его следует проверить полностью. Уж не знаю, хватит ли ему сил перечитать всю эту писанину, но я искреннее благодарен ему за такой благородный порыв!</p>"
    )
    showNews()
  })
  new2.addEventListener("click", function () {
    create_news_image("news_image", "img/site/3-1.jpg")
    create_news_date("news_date", "<span>10 ДЕКАБРЯ 2020 г.</span>")
    create_news_text(
      "news_text",
      '<p>Грустновато мне писать это, но пока я так и не выложил проект в общий доступ. Непроработанным до конца не хочется представлять людям, а с другой стороны совершенно нет возможности допиливать его до конца. Объективную готовность игры я оцениваю на 97%. Казалось бы, жалкие 3%. Но так часто бывает с некоммерческими проектами. Заниматься ими можно пока есть энтузиазм и время. Когда энтузиазм гаснет, а времени не остаётся… Остаётся только ждать счастливого момента, когда настроение вёрнётся, а там уж хоть по ночам!</p><p>Тут стоит отметить, что делаю я эту игрушку исключительно в своё удовольствие. С желания сделать её всё начиналось, и она остаётся для меня значимым проектом, а значит, закончена она будет однозначно. Хорошо ещё, что я не анонсировал её широкой общественности в узких кругах! Никто ничего от меня не ждёт. Но это тоже имеет свои негативные стороны. Окружающие всё-таки умеют подбодрить и рассказать о том, какой ты ленивый увалень и пустозвон. Это подбадривает.</p><p>Мой скрытый помощник подключился к проверке текста сюжета и бета-тесту. Надо сказать, что это было очень здорово, так как он выявил интересный баг, который ни я, ни другой тестер не заметили раньше. Этот баг ломал человеческое прохождение сюжета, однако из него можно было выпутаться с помощью другой уязвимости. Сегодня игра имеет версию уже v. 0.5.2.1 beta. Ух ты! Даже ого! Ниже публикую то малое, что было сделано за столь долгое время (копирую как есть, но удаляю некоторые сюжетные спойлеры):</p><p>*ЧТО НОВОГО:</p><p>- на небольших разрешениях экрана страница возвращается наверх при выборе действия;</p><p>- добавлено отображение противоядия в инвентаре;</p><p>*ИСПРАВЛЕНО:</p><p>- картинка на 4 уровне лифта в бункере;</p><p>- опечатка в тексте диалога с Майклом (24 патрона для дробовика вместо 40);</p><p>- баг в баре при покупке только одного вида алкоголя;</p><p>- баг с сохранением (после загрузки и повторного сохранения все переменные получали значение переменных до загрузки);</p><p>- искажения текста в экранах для мобильной версии;</p><p>- баг со временем во время выполнения одного из заданий;</p><p>- баг со сменой текста для поста охраны в Пригороде Хаба;</p><p>- баг с отображением одной из концовок;</p><p>- баг, при котором не отображалось изменение здоровья после применения стимулятора;</p><p>- отображение основного текста со скроллом на больших экранах;</p><p>- отображение параметров героя со скроллом на iphone 4 и Ipad;</p><p>- подложка под игру сплошного света фона, чтобы не было видно белых полос при обновлении страницы на мобильных устройствах;</p><p>- исправлена логическая ошибка в тексте: "луч света...сквозь окно" на "луч света...сквозь прорехи в крыше";</p><p>- исправлена логическая ошибка в тексте: "до самого вечера" на "до самой ночи";</p><p>- после выхода из тюрьмы снижается уровень сытости (если предыдущее значение больше 1);</p><p>- опечатки, грамматические, пунктуационные и стилистические ошибки в Прологе.</p>'
    )
    showNews()
  })
  new3.addEventListener("click", function () {
    create_news_image("news_image", "img/site/4-1.jpg")
    create_news_date("news_date", "<span>1 МАЯ 2021 г.</span>")
    create_news_text(
      "news_text",
      '<p>С Первомаем, товарищи!</p><p>В этот ясный солнечный день я рад сообщить, что все работы над текстовым квестом FALLOUT: ОПЕРАЦИЯ ВОЗМЕЗДИЕ завершены. Последние правки я совершил несколько минут назад. Отрадно, что день релиза совпал с международным Днём труда. Это действительно был тот ещё труд! Не скрою, порой бывали периоды отчаяния, но это я больше отношу к творческим мукам.</p><p>Через некоторое время я переведу игру в открытый репозиторий, чтобы каждый мог воспользоваться моими наработками для создания собственных квестов. Код игры максимально простой и тщательно прокомментирован. Как раз подойдёт начинающим разработчикам. Когда игра получит первые отзывы и будут исправлены возможные недочёты, я выложу ссылку на файлы внизу этой страницы.</p><p>В релизную версию игры была добавлена композиция «Сквозь ущелье», написанная камрадами из группы ЛунОкоЛ & Fe. Парни, ещё раз спасибо!</p><p>Также я поправил картинки из Пролога. Они были кошмарны! Когда я начал реализовывать квест, то, разумеется, столкнулся с необходимостью создания изображений. Я не художник (от слова совсем), поэтому наверняка на каких-то картинках мои уши попадут на холст. Прошу сообщить об этих неточностях мне по этому адресу:<a href="mailto:ds@ds-shelter.ru">ds@ds-shelter.ru</a>.</p><p>Много хочется рассказать о долгом пути к созданию игры, но это будет слишком затянуто. Сегодня мне не терпится ещё раз пройти мой долгострой уже на телефоне! Я намекаю на то, что в игре есть адаптация под все популярные разрешения, а это значит, что играть можно не только на ПК, но и удобно расположившись на диване со смартфоном.</p><p>Спасибо за внимание!</p>'
    )
    showNews()
  })
  new4.addEventListener("click", function () {
    create_news_image("news_image", "img/site/5.png")
    create_news_date("news_date", "<span>27 СЕНТЯБРЯ 2025 г.</span>")
    create_news_text(
      "news_text",
      "<p>Привет!</p><p>Ох, как же много воды утекло с релиза моей первой игры. Не хочется писать очередной длинющий лонгрид. Поэтому сразу к делу!</p><p>Сделал апдейт игры: распилил общий файл на несколько поменьше (да-да, вот такой я был программист!). К сожалению, рефакторинга там ещё море требуется. А в идеале перевести бы проект на Vue или React. Но это когда-нибудь потом. Главное: пофиксил множество финалов, которые раньше были не достижимы. Фикс концовок квеста, спустя 4 года! Лучше поздно чем никогда! Ещё много мелких фиксов было по монитору состояний. Остались ещё далеко не минорные баги, но они уже не такие страшные. Хотя есть даже глитчи, позволяющие получить практически бесконечное количество крышек и патронов. Сейчас у меня новая идея - написать большой тестовый фреймворк, чтобы прийти к zero bugs. Мой проект снова ожил после более чем 4х летнего перерыва. Чувствую, всю жизнь буду заниматься этим проектом время от времени! В общем, скомканное получилось сообщение, но всё равно, наверняка, это пало кому интересно.</p><p>Вот когда-нибудь обязательно переведу проект из текста в 3d. Я теперь учёный, даже корочка есть! Посмотрим как будет.</p><p>Официальная версия текущего билда - 2.0. Всем удачи и спасибо за внимание!</p>"
    )
    showNews()
  })
})

// <p></p>
